# VerticalFlipped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..VerticalFlipped Property
HostedSweep Class See Also
---
Retrieve the vertical flip status of the hosted sweep object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool VerticalFlipped { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VerticalFlipped As Boolean
	Get
```

Visual C++
---
```text
public:
property bool VerticalFlipped {
	bool get ();
}
```

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace